name: "yolo"
platform: "onnxruntime_onnx"
max_batch_size: 8

# YOLO11 model configuration
# Compatible with YOLO11n.onnx converted from yolo11n.pt
input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [ 3, 640, 640 ]
  }
]
output [
  {
    name: "output0"
    data_type: TYPE_FP32
    dims: [ 84, 8400 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]

optimization {
  execution_accelerators {
    cpu_execution_accelerator : [ {
      name : "openvino"
    } ]
  }
}